espressif/esp-idf/components/soc/esp32h4/register/soc/gpio_reg.h
/** GPIO_FUNC12_IN_SEL_CFG_REG register
 *  Configuration register for input signal 12
 */
#define GPIO_FUNC12_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x304)
/** GPIO_FUNC12_IN_SEL : R/W; bitpos: [6:0]; default: 96;
 *  Configures to select a pin from the 40 GPIO pins to connect the input signal 12.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  38: Select GPIO38
 *  39: Select GPIO39
 *  Or
 *  0x40: A constantly high input
 *  0x60: A constantly low input
 */
#define GPIO_FUNC12_IN_SEL    0x0000007FU
#define GPIO_FUNC12_IN_SEL_M  (GPIO_FUNC12_IN_SEL_V << GPIO_FUNC12_IN_SEL_S)
#define GPIO_FUNC12_IN_SEL_V  0x0000007FU
#define GPIO_FUNC12_IN_SEL_S  0
/** GPIO_FUNC12_IN_INV_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC12_IN_INV_SEL    (BIT(7))
#define GPIO_FUNC12_IN_INV_SEL_M  (GPIO_FUNC12_IN_INV_SEL_V << GPIO_FUNC12_IN_INV_SEL_S)
#define GPIO_FUNC12_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC12_IN_INV_SEL_S  7
/** GPIO_SIG12_IN_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG12_IN_SEL    (BIT(8))
#define GPIO_SIG12_IN_SEL_M  (GPIO_SIG12_IN_SEL_V << GPIO_SIG12_IN_SEL_S)
#define GPIO_SIG12_IN_SEL_V  0x00000001U
#define GPIO_SIG12_IN_SEL_S  8

/** GPIO_FUNC13_IN_SEL_CFG_REG register
 *  Configuration register for input signal 13
 */
#define GPIO_FUNC13_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x308)
/** GPIO_FUNC13_IN_SEL : R/W; bitpos: [6:0]; default: 96;
 *  Configures to select a pin from the 40 GPIO pins to connect the input signal 13.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  38: Select GPIO38
 *  39: Select GPIO39
 *  Or
 *  0x40: A constantly high input
 *  0x60: A constantly low input
 */
#define GPIO_FUNC13_IN_SEL    0x0000007FU
#define GPIO_FUNC13_IN_SEL_M  (GPIO_FUNC13_IN_SEL_V << GPIO_FUNC13_IN_SEL_S)
#define GPIO_FUNC13_IN_SEL_V  0x0000007FU
#define GPIO_FUNC13_IN_SEL_S  0
/** GPIO_FUNC13_IN_INV_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC13_IN_INV_SEL    (BIT(7))
#define GPIO_FUNC13_IN_INV_SEL_M  (GPIO_FUNC13_IN_INV_SEL_V << GPIO_FUNC13_IN_INV_SEL_S)
#define GPIO_FUNC13_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC13_IN_INV_SEL_S  7
/** GPIO_SIG13_IN_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG13_IN_SEL    (BIT(8))
#define GPIO_SIG13_IN_SEL_M  (GPIO_SIG13_IN_SEL_V << GPIO_SIG13_IN_SEL_S)
#define GPIO_SIG13_IN_SEL_V  0x00000001U
#define GPIO_SIG13_IN_SEL_S  8

/** GPIO_FUNC14_IN_SEL_CFG_REG register
 *  Configuration register for input signal 14
 */
#define GPIO_FUNC14_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x30c)
/** GPIO_FUNC14_IN_SEL : R/W; bitpos: [6:0]; default: 96;
 *  Configures to select a pin from the 40 GPIO pins to connect the input signal 14.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  38: Select GPIO38
 *  39: Select GPIO39
 *  Or
 *  0x40: A constantly high input
 *  0x60: A constantly low input
 */
#define GPIO_FUNC14_IN_SEL    0x0000007FU
#define GPIO_FUNC14_IN_SEL_M  (GPIO_FUNC14_IN_SEL_V << GPIO_FUNC14_IN_SEL_S)
#define GPIO_FUNC14_IN_SEL_V  0x0000007FU
#define GPIO_FUNC14_IN_SEL_S  0
/** GPIO_FUNC14_IN_INV_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC14_IN_INV_SEL    (BIT(7))
#define GPIO_FUNC14_IN_INV_SEL_M  (GPIO_FUNC14_IN_INV_SEL_V << GPIO_FUNC14_IN_INV_SEL_S)
#define GPIO_FUNC14_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC14_IN_INV_SEL_S  7
/** GPIO_SIG14_IN_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG14_IN_SEL    (BIT(8))
#define GPIO_SIG14_IN_SEL_M  (GPIO_SIG14_IN_SEL_V << GPIO_SIG14_IN_SEL_S)
#define GPIO_SIG14_IN_SEL_V  0x00000001U
#define GPIO_SIG14_IN_SEL_S  8

/** GPIO_FUNC15_IN_SEL_CFG_REG register
 *  Configuration register for input signal 15
 */
#define GPIO_FUNC15_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x310)
/** GPIO_FUNC15_IN_SEL : R/W; bitpos: [6:0]; default: 96;
 *  Configures to select a pin from the 40 GPIO pins to connect the input signal 15.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  38: Select GPIO38
 *  39: Select GPIO39
 *  Or
 *  0x40: A constantly high input
 *  0x60: A constantly low input
 */
#define GPIO_FUNC15_IN_SEL    0x0000007FU
#define GPIO_FUNC15_IN_SEL_M  (GPIO_FUNC15_IN_SEL_V << GPIO_FUNC15_IN_SEL_S)
#define GPIO_FUNC15_IN_SEL_V  0x0000007FU
#define GPIO_FUNC15_IN_SEL_S  0
/** GPIO_FUNC15_IN_INV_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC15_IN_INV_SEL    (BIT(7))
#define GPIO_FUNC15_IN_INV_SEL_M  (GPIO_FUNC15_IN_INV_SEL_V << GPIO_FUNC15_IN_INV_SEL_S)
#define GPIO_FUNC15_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC15_IN_INV_SEL_S  7
/** GPIO_SIG15_IN_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG15_IN_SEL    (BIT(8))
#define GPIO_SIG15_IN_SEL_M  (GPIO_SIG15_IN_SEL_V << GPIO_SIG15_IN_SEL_S)
#define GPIO_SIG15_IN_SEL_V  0x00000001U
#define GPIO_SIG15_IN_SEL_S  8

/** GPIO_FUNC16_IN_SEL_CFG_REG register
 *  Configuration register for input signal 16
 */
#define GPIO_FUNC16_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x314)
/** GPIO_FUNC16_IN_SEL : R/W; bitpos: [6:0]; default: 96;
 *  Configures to select a pin from the 40 GPIO pins to connect the input signal 16.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  38: Select GPIO38
 *  39: Select GPIO39
 *  Or
 *  0x40: A constantly high input
 *  0x60: A constantly low input
 */
#define GPIO_FUNC16_IN_SEL    0x0000007FU
#define GPIO_FUNC16_IN_SEL_M  (GPIO_FUNC16_IN_SEL_V << GPIO_FUNC16_IN_SEL_S)
#define GPIO_FUNC16_IN_SEL_V  0x0000007FU
#define GPIO_FUNC16_IN_SEL_S  0
/** GPIO_FUNC16_IN_INV_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC16_IN_INV_SEL    (BIT(7))
#define GPIO_FUNC16_IN_INV_SEL_M  (GPIO_FUNC16_IN_INV_SEL_V << GPIO_FUNC16_IN_INV_SEL_S)
#define GPIO_FUNC16_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC16_IN_INV_SEL_S  7
/** GPIO_SIG16_IN_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG16_IN_SEL    (BIT(8))
#define GPIO_SIG16_IN_SEL_M  (GPIO_SIG16_IN_SEL_V << GPIO_SIG16_IN_SEL_S)
#define GPIO_SIG16_IN_SEL_V  0x00000001U
#define GPIO_SIG16_IN_SEL_S  8

/** GPIO_FUNC17_IN_SEL_CFG_REG register
 *  Configuration register for input signal 17
 */
#define GPIO_FUNC17_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x318)
/** GPIO_FUNC17_IN_SEL : R/W; bitpos: [6:0]; default: 96;
 *  Configures to select a pin from the 40 GPIO pins to connect the input signal 17.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  38: Select GPIO38
 *  39: Select GPIO39
 *  Or
 *  0x40: A constantly high input
 *  0x60: A constantly low input
 */
#define GPIO_FUNC17_IN_SEL    0x0000007FU
#define GPIO_FUNC17_IN_SEL_M  (GPIO_FUNC17_IN_SEL_V << GPIO_FUNC17_IN_SEL_S)
#define GPIO_FUNC17_IN_SEL_V  0x0000007FU
#define GPIO_FUNC17_IN_SEL_S  0
/** GPIO_FUNC17_IN_INV_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC17_IN_INV_SEL    (BIT(7))
#define GPIO_FUNC17_IN_INV_SEL_M  (GPIO_FUNC17_IN_INV_SEL_V << GPIO_FUNC17_IN_INV_SEL_S)
#define GPIO_FUNC17_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC17_IN_INV_SEL_S  7
/** GPIO_SIG17_IN_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG17_IN_SEL    (BIT(8))
#define GPIO_SIG17_IN_SEL_M  (GPIO_SIG17_IN_SEL_V << GPIO_SIG17_IN_SEL_S)
#define GPIO_SIG17_IN_SEL_V  0x00000001U
#define GPIO_SIG17_IN_SEL_S  8

/** GPIO_FUNC18_IN_SEL_CFG_REG register
 *  Configuration register for input signal 18
 */
#define GPIO_FUNC18_IN_SEL_CFG_REG (DR_REG_GPIO_BASE + 0x31c)
/** GPIO_FUNC18_IN_SEL : R/W; bitpos: [6:0]; default: 96;
 *  Configures to select a pin from the 40 GPIO pins to connect the input signal 18.
 *  0: Select GPIO0
 *  1: Select GPIO1
 *  ......
 *  38: Select GPIO38
 *  39: Select GPIO39
 *  Or
 *  0x40: A constantly high input
 *  0x60: A constantly low input
 */
#define GPIO_FUNC18_IN_SEL    0x0000007FU
#define GPIO_FUNC18_IN_SEL_M  (GPIO_FUNC18_IN_SEL_V << GPIO_FUNC18_IN_SEL_S)
#define GPIO_FUNC18_IN_SEL_V  0x0000007FU
#define GPIO_FUNC18_IN_SEL_S  0
/** GPIO_FUNC18_IN_INV_SEL : R/W; bitpos: [7]; default: 0;
 *  Configures whether or not to invert the input value.
 *  0: Not invert
 *  1: Invert
 */
#define GPIO_FUNC18_IN_INV_SEL    (BIT(7))
#define GPIO_FUNC18_IN_INV_SEL_M  (GPIO_FUNC18_IN_INV_SEL_V << GPIO_FUNC18_IN_INV_SEL_S)
#define GPIO_FUNC18_IN_INV_SEL_V  0x00000001U
#define GPIO_FUNC18_IN_INV_SEL_S  7
/** GPIO_SIG18_IN_SEL : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to route signals via GPIO matrix.
 *  0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in
 *  IO MUX.
 *  1: Route signals via GPIO matrix.
 */
#define GPIO_SIG18_IN_SEL    (BIT(8))
#define GPIO_SIG18_IN_SEL_M  (GPIO_SIG18_IN_SEL_V << GPIO_SIG18_IN_SEL_S)
#define GPIO_SIG18_IN_SEL_V  0x00000001U
#define GPIO_SIG18_IN_SEL_S  8

